import { expandWazaRules } from "./expand";
import { 体勢, 技, 攻め, type 級段位別 } from "./types";

const 一覧 = [
  {
    級段位: 5,
    技一覧: [
      {
        攻め: [攻め.正面],
        体勢: [体勢.立ち技, 体勢.座技],
        技: [技.教],
      },
      {
        組み合わせ: [
          {
            攻め: 攻め.突き,
            技: 技.小手,
          },
          {
            攻め: 攻め.片手,
            技: 技.四方,
          },
          {
            攻め: 攻め.正面,
            技: 技.入り身,
          },
          {
            基本動作: "体の転換",
          },
          {
            基本動作: "座技呼吸法",
          },
        ],
      },
    ],
  },
  {
    級段位: 3,
    技一覧: [
      {
        攻め: [攻め.正面, 攻め.横面, 攻め.片手, 攻め.突き, 攻め.交差],
        技: [技.小手, 技.四方, 技.入り身, 技.呼吸, 技.回転],
      },
      {
        組み合わせ: [
          {
            攻め: 攻め.両手,
            技: 技.天地,
          },
        ],
      },
    ],
  },
  {
    級段位: 1,
    技一覧: [
      {
        攻め: [攻め.両手, 攻め.諸手],
        技: [技.小手, 技.四方, 技.入り身, 技.回転],
      },
      {
        体勢: [体勢.半身半立ち],
        攻め: [攻め.片手, 攻め.両手],
        技: [技.四方],
      },
      {
        攻め: [攻め.横面],
        技: [技.五教],
      },
    ],
  },
  {
    級段位: -1,
    技一覧: [
      {
        攻め: [
          攻め.正面,
          攻め.横面,
          攻め.突き,
          攻め.片手,
          攻め.交差,
          攻め.諸手,
          攻め.両手,
          攻め.胸,
          攻め.肩,
          攻め.両肩,
        ],
        体勢: [体勢.立ち技],
        技: [
          技.入り身,
          技.四方,
          技.小手,
          技.隅,
          技.回転,
          技.側方入り身,
          技.天秤,
          技.十字,
          技.腕絡み,
          技.腰投げ,
          技.呼吸,
          技.教,
        ],
      },
      {
        攻め: [
          攻め.正面,
          攻め.横面,
          攻め.突き,
          攻め.片手,
          攻め.交差,
          攻め.諸手,
          攻め.両手,
          攻め.胸,
          攻め.肩,
          攻め.両肩,
        ],
        体勢: [体勢.座技],
        技: [
          技.入り身,
          技.四方,
          技.小手,
          技.隅,
          技.回転,
          技.側方入り身,
          技.天秤,
          技.十字,
          技.呼吸,
          技.教,
        ],
        除外: [{ 攻め: 攻め.諸手, 技: 技.回転.内 }],
      },
      {
        攻め: [攻め.片手, 攻め.両手],
        体勢: [体勢.半身半立ち],
        技: [
          技.入り身,
          技.四方,
          技.小手,
          技.隅,
          技.回転,
          技.側方入り身,
          技.天秤,
          技.十字,
          技.腕絡み,
          技.呼吸,
          技.教,
        ],
      },
      {
        攻め: [攻め.両手],
        技: [技.天地],
        体勢: [体勢.座技, 体勢.立ち技],
      },
    ],
  },
] satisfies readonly 級段位別[];

export const wazadata = expandWazaRules(一覧);
