import { expandWazaRules } from "./expand";
import { 体勢, 技, 攻め, type 級段位別 } from "./types";

const 一覧 = [
  {
    級段位: 5,
    技一覧: [
      {
        攻め: [攻め.正面],
        体勢: [体勢.立ち技, 体勢.座技],
        技: [
          技.教.一.表,
          技.教.一.裏,
          技.教.二.表,
          技.教.二.裏,
          技.教.三.表,
          技.教.三.裏,
          技.教.四.表,
          技.教.四.裏,
        ],
      },
      {
        組み合わせ: [
          {
            攻め: 攻め.突き,
            技: 技.小手,
          },
          {
            攻め: 攻め.片手,
            技: 技.四方.表,
          },
          {
            攻め: 攻め.片手,
            技: 技.四方.裏,
          },
          {
            攻め: 攻め.正面,
            技: 技.入り身,
          },
          {
            基本動作: "体の転換",
          },
          {
            基本動作: "座技呼吸法",
          },
        ],
      },
    ],
  },
  {
    級段位: 3,
    技一覧: [
      {
        攻め: [攻め.正面, 攻め.横面, 攻め.片手, 攻め.突き, 攻め.交差],
        技: [技.小手, 技.四方.表, 技.四方.裏, 技.入り身],
      },
      {
        組み合わせ: [
          {
            攻め: 攻め.両手,
            技: 技.天地,
          },
        ],
      },
    ],
  },
  {
    級段位: 1,
    技一覧: [
      {
        攻め: [攻め.両手, 攻め.諸手],
        技: [技.小手, 技.四方.表, 技.四方.裏, 技.入り身],
      },
      {
        体勢: [体勢.半身半立ち],
        攻め: [攻め.片手, 攻め.両手],
        技: [技.四方.表, 技.四方.裏],
      },
      {
        組み合わせ: [
          {
            攻め: 攻め.横面,
            技: 技.教.五.表,
          },
          {
            攻め: 攻め.横面,
            技: 技.教.五.裏,
          },
        ],
      },
    ],
  },
] satisfies readonly 級段位別[];

export const wazadata = expandWazaRules(一覧);
